In [1]:
%load_ext sql
%sql sqlite:///demo.db

### Q1.1

In [2]:
%%sql

DROP TABLE IF EXISTS tweets;

CREATE TABLE tweets(tweet varchar(255), cat int, dog int, fish int, taco int, lunch int, beach int, circle int);

INSERT INTO tweets VALUES("A", 0,0,1,1,1,1,0);
INSERT INTO tweets VALUES("B", 1,1,0,0,0,0,1);
INSERT INTO tweets VALUES("C", 0,1,0,0,0,0,1);
INSERT INTO tweets VALUES("D", 0,0,2,1,2,1,1);
INSERT INTO tweets VALUES("E", 1,0,1,1,0,0,0);

select * from tweets;

 * sqlite:///demo.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[('A', 0, 0, 1, 1, 1, 1, 0),
 ('B', 1, 1, 0, 0, 0, 0, 1),
 ('C', 0, 1, 0, 0, 0, 0, 1),
 ('D', 0, 0, 2, 1, 2, 1, 1),
 ('E', 1, 0, 1, 1, 0, 0, 0)]

In [6]:
%%sql 

select sum(cat), sum(dog) from tweets

 * sqlite:///demo.db
Done.

[(2, 2)]

In [7]:
%%sql 

select sum(cat), sum(dog), sum(fish) from tweets

 * sqlite:///demo.db
Done.

[(2, 2, 4)]

In [8]:
%%sql 

select sum(cat), sum(dog), sum(fish), sum(taco) from tweets

 * sqlite:///demo.db
Done.

[(2, 2, 4, 3)]

In [3]:
%%sql 

select count(cat), count(dog) from tweets where cat!=0 and dog!=0;

 * sqlite:///demo.db
Done.

[(1, 1)]

### Q1.2

In [10]:
%%sql

DROP TABLE IF EXISTS image_data;

CREATE TABLE image_data(image charvar(255), location charvar(255), time varchar(255), people varchar(255));

INSERT INTO image_data VALUES("A", "New York", "12:00", "julia");
INSERT INTO image_data VALUES("B", "New York", "12:00", "bob");
INSERT INTO image_data VALUES("B", "Boston", "12:00", "kevin");
INSERT INTO image_data VALUES("C", "Boston", "22:00", "bob");
INSERT INTO image_data VALUES("D", "Vancouver", "19:30", "julia");
INSERT INTO image_data VALUES("E", "Vancouver", "20:45", "alex");
INSERT INTO image_data VALUES("F", "Toronto", "02:15", "julia");
INSERT INTO image_data VALUES("G", "Toronto", "22:00", "jill");

SELECT * FROM image_data;

 * sqlite:///demo.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[('A', 'New York', '12:00', 'julia'),
 ('B', 'New York', '12:00', 'bob'),
 ('B', 'Boston', '12:00', 'kevin'),
 ('C', 'Boston', '22:00', 'bob'),
 ('D', 'Vancouver', '19:30', 'julia'),
 ('E', 'Vancouver', '20:45', 'alex'),
 ('F', 'Toronto', '02:15', 'julia'),
 ('G', 'Toronto', '22:00', 'jill')]

In [3]:
%%sql

SELECT location, count(people) FROM image_data group by location

 * sqlite:///demo.db
Done.

[('Boston', 2), ('New York', 2), ('Toronto', 2), ('Vancouver', 2)]

In [11]:
%%sql

SELECT count(people) FROM image_data where people="julia"

 * sqlite:///demo.db
Done.

[(3,)]